Revit 2024 API
Parameter.AsValueString Method (FormatOptions)
Get the parameter value as a string with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string AsValueString(
	FormatOptions formatOptions
)
Visual Basic
Public Function AsValueString ( _
	formatOptions As FormatOptions _
) As String
Visual C++
public:
String^ AsValueString(
	FormatOptions^ formatOptions
)
Parameters
formatOptions
Type: Autodesk.Revit.DB.FormatOptions
Options for formatting the string.
Return Value
The string that represents the parameter value.
See Also
Parameter Class
AsValueString Overload
Autodesk.Revit.DB Namespace